tests/stubs/Paypal_batch_payout_details_fail_response.json

{
    "total_items": 1,
    "total_pages": 1,
    "batch_header": {
        "payout_batch_id": "LEP6947CGTKRL",
        "batch_status": "SUCCESS",
        "time_created": "2018-03-13T12:44:47Z",
        "time_completed": "2018-03-13T12:44:55Z",
        "time_closed": "2018-03-13T12:44:55Z",
        "sender_batch_header": {
            "email_subject": "You got a Test"
        },
        "amount": {
            "currency": "USD",
            "value": "550.0"
        },
        "fees": {
            "currency": "USD",
            "value": "2.75"
        },
        "displayable": true
    },
    "items": [
        {
            "payout_item_id": "5MYSR9GT8AEUG",
            "transaction_id": "2JE19762AW167960J",
            "activity_id": "0E158638XS0329103",
            "transaction_status": "FAILED",
            "payout_item_fee": {
                "currency": "USD",
                "value": "0.25"
            },
            "payout_batch_id": "LEP6947CGTKRL",
            "payout_item": {
                "recipient_type": "PHONE",
                "amount": {
                    "currency": "USD",
                    "value": "50.0"
                },
                "note": "Mr. Rob",
                "receiver": "93847858694",
                "sender_item_id": "X1"
            },
            "time_processed": "2018-03-13T12:44:51Z",
            "links": [
                {
                    "href": "https://api-m.sandbox.paypal.com/v1/payments/payouts-item/5MYSR9GT8AEUG",
                    "rel": "item",
                    "method": "GET"
                }
            ]
        }
    ],
    "links": [
        {
            "href": "https://api-m.sandbox.paypal.com/v1/payments/payouts/LEP6947CGTKRL?page_size=5&page=2",
            "rel": "next",
            "method": "GET"
        },
        {
            "href": "https://api-m.sandbox.paypal.com/v1/payments/payouts/LEP6947CGTKRL?page_size=5&page=3",
            "rel": "last",
            "method": "GET"
        },
        {
            "href": "https://api-m.sandbox.paypal.com/v1/payments/payouts/LEP6947CGTKRL?page_size=5&page=1",
            "rel": "self",
            "method": "GET"
        }
    ]
}
